app/controllers/flickr_controller.rb

SELECT * FROM "pictures" WHERE ("pictures"."id" = 398)
---
  def grab_pic
    pic = Picture.find(rand(500))